[
    {
        "original": "Kathmandu University\nThis article has multiple issues. Please help improve it or discuss these issues on the talk page. (Learn how and when to remove these messages)\n|\nकाठमाडौं विश्वविद्यालय | |\nOther name | KU |\n|---|---|\n| Motto | Quality Education for Leadership |\n| Type | Autonomous public institution |\n| Established | 1991 |\n| Founders | Government of Nepal |\n| Endowment | NPR 301,192,084.00 |\n| Chancellor | Prime Minister of Nepal |\n| Vice-Chancellor | Dr. Achyut Prasad Wagle [1] |\n| Students | 21000+ |\n| Location | , Nepal 27°37′11″N 85°32′19″E / 27.6196°N 85.5386°E |\n| Website | ku |\nKathmandu University (KU) (Nepali: काठमाण्डौ विश्वविद्यालय) is an autonomous university in Nepal. It is the third oldest university in Nepal, located in Dhulikhel of Kavrepalanchok District, about 30 km (19 mi) east of Kathmandu. It was established in 1991 with the motto \"Quality Education for Leadership.\" KU operates through its seven schools, and campuses in Dhulikhel, Lalitpur and Panchkhal. The university offers undergraduate, graduate and postgraduate courses in a variety of fields.[2]\nHistory\n[edit]The precursor to the university, Kathmandu Valley Campus (a private campus under the affiliation of Tribhuvan University) was established in 1985, which provided courses in the Intermediate of Science (ISc) level. The proposal to establish the university was discussed in the Parliament later, and it was approved through an Act on 11 December 1991.[citation needed]\nFoundation\n[edit]When established in November 1991 as a non-profit, autonomous, public university[3] by an act[4] KU became the first privately managed public institution of higher learning in Nepal. The predecessor of the university was the Kathmandu Valley Campus founded in 1985. The campus started as a private campus affiliated to Tribhuvan University and offered courses in science at the intermediate level (I. SC).\nKathmandu University started its academic program in 1992 with an Intermediate in Science program. In 1994, the university launched Bachelor programs in Pharmacy, Biology, and Engineering (electrical and electronics, computer, and mechanical). Later, Environmental Engineering and Sciences were included in its academic program. School of management launched its undergraduate program on Bachelor of Business Administration (BBA) in 1997 and Bachelor of Business Information Systems (BBIS) in 1999 respectively.[5] M.Phil. and Ph.D. programs were started in 1997. The university also started a Law program, under the School of Law in December 2013.[6]\nMilestones\n[edit]Source:[7]\n- August 1985 Establishment of Kathmandu University Valley Campus with academic affiliation to Tribhuvan University. Commencement of Intermediate of Science courses.\n- November 1991 Kathmandu University chartered by an act of parliament.\n- December 1991 First Senate meeting presided by the prime minister and chancellor of Kathmandu University, Girija Prasad Koirala. Appointment of Dr. Suresh Raj Sharma as the vice-chancellor of the university.\n- January 1992 Appointment of Dr. Sitaram Adhikary as the registrar of the university.\n- July 1992 School of Science opened in Tangal. Appointment of Dr. Bhadra Man Tuladhar as the dean of the School of Science. Commencement of Kathmandu University's own Intermediate of Science courses.\n- August 1993 School of Management opened in New Baneswor. Appointment of Professor Krishna Swaminathan as the dean of the School of Management. Commencement of Masters of Business Administration program.\n- March 1994 Academic Council decided to introduce three-year degree programs for B.A./B.Sc. pass, and four-year degree programs for B.A., B.E.[8]\nOrganization and administration\n[edit]Kathmandu University provides education through seven schools:\n- School of Arts (KUSOA)\n- School of Education (KUSOED)\n- School of Engineering (KUSOE)\n- School of Law (KUSOL)\n- School of Management (KUSOM)\n- School of Medical Sciences (KUSMS)\n- School of Science (KUSOS)\nKU has proposed two new schools in Panchkhal Municipality under which Agriculture program and Artificial Program has been started temporarily in Panchkhal whereas KU-KUNJ to be made very soon.\n- School of Agriculture\n- School of Forestry\nThe School of Medical Sciences (KUSMS) and the School of Engineering (KUSOE) have highest number of students. The School of Medical Science was formerly known as KUMS, but in 2006 its name was changed to KUSMS, with the view that the school not only trains medical graduates and postgraduates but also runs paramedical disciplines. The School of Science, School of Engineering and one department of School of Management (Department of Management Informatics and Communication DoMIC) are present in the university premises, unlike other schools that have affiliated colleges around the nation. School of Engineering currently runs undergraduate and graduate-level courses mostly in Electrical and Electronics, Mechanical, Computer, Civil and Geomatics Engineering. It has also recently launched Chemical Engineering and Bachelor of Architecture. School of Management runs undergraduate and graduate level courses like Bachelor of Business Administration, Bachelor of Business Information Systems, Master of Business Administration, Executive MBA, MPPM and many more. The School of Science is currently conducting classes in B.Sc. Human Biology, Environmental Science and Engineering, Bio-Technology, and Applied Physics. Chemical Engineering, BSc nursing In Midwifery, and Bachelors in Physiotherapy is the recent addition to the list of the subject being offered by KU to students in Nepal for the first time.\nAcademics\n[edit]Undergraduate program\n[edit]The university provides undergraduate to postgraduate programs in the fields of engineering, science, management, arts, education, law, and medical sciences. It provides undergraduate courses in engineering (Chemical, Civil, Computer, Electrical & Electronics, Mechanical, Environmental, Geomatics, Architecture), Science (Biotechnology, Computer Science, Data Science, Artificial Intelligence, Environmental science, Pharmacy, Human biology, Computational Mathematics & Applied physics), Management (Bachelors in Business Administration, Bachelor of Business Information Systems, executive MBA, Masters in Business Administration ...), Arts (music, media, community development, fine art, and economics), medical science (MBBS, MD/MS, MCH/DM in various medical specialties and sub-specialties, BSC Nursing, PCL Nursing, Bachelor in Nursing, BSC Midwifery, Bachelor in Physiotherapy BDS).[citation needed]\nAffiliations\n[edit]The university, in partnership with Rangjung Yeshe Institute, runs the Centre for Buddhist Studies. The centre offers undergraduate and graduate programs leading to Bachelor of Arts and Master of Arts degrees in Buddhist Studies and Himalayan languages.[9][10] It provides research facilities for visiting international scholars of Buddhism for their graduate or postgraduate projects.[11] In the summer, it hosts study-abroad programs and conducts intensive language immersion programs in Tibetan, Nepali, and Sanskrit.[12][13][14][15]\nThe university owns Kathmandu University High School.\nThe first convocation of the university was held on 7 August 1995 and the convocation address was given by management guru, Dr. M.B. Atreya of India. The second convocation was held on 8 December 1996 and the convocation address was delivered by Professor N. Gyanam, vice chancellor, Pondicherry University and the president of Association of Indian Universities. The third convocation was held on 9 November 1997 and the convocation address was delivered by Professor (Dr.) M. Rammohan Rao, director, Indian Institute of Management, Bangalore, India. The fourth convocation, held on 17 September 1998, was addressed by the prominent scholar and ex-vice chancellor of Norwegian Institute of Technology, Norway. For the first time in Nepal, Kathmandu University convocated a batch of environmental, business information systems, mechanical, electrical, electronics and computer science and engineering graduates.\nStudent activities\n[edit]Inter-Departmental Clubs\n- Kathmandu University Hult Prize Club\n- Students for the Exploration and Development of Space-Kathmandu University (SEDS-KU)\n- Green Club of Thoughts\n- AIESEC Kathmandu University\n- Youth For Change- Kathmandu University\n- Amnesty International Nepal Kathmandu University Youth Network (AIKUYN)\n- Kathmandu University Robotics Club (KURC)\n- Kathmandu University Youth Red Cross Circle (KUYRCC)\n- KU Society of Music and Culture (KUSMC)\n- Rotaract Club of Kathmandu University (RTC-KU)\n- Kathmandu University Model United Nations club (KUMUNc)\nIntra-School Clubs:\n•School of Management :\n• KUSOM Finance Club\n•KUSOM Sport Club\n•KUSOM Creative Club\n•KUSOM Events Club\n• KUSOM Information System Club\n•KUSOM Debate Club\n•KUSOM Publication Club\nDepartmental Clubs\n- Association of Mechanical Engineering Students (AMES)\n- Nature and Social Concern Society (NSCS)\n- Forum for Environmental Conservation and Management (FECAM)\n- Forum For Pharmacy (FoP)\n- Geomatics Engineering Society (GES)\n- Kathmandu University Biotechnology Creatives (KUBiC)\n- Kathmandu University Circle of Noble Chemineers (KUCONC)\n- Kathmandu University Computational Mathematics Club (KUCMC)\n- Kathmandu University Computer Club (KUCC)\n- Kathmandu University Computer Club (KUCC)\n- Kathmandu University Civil Engineering Club (KUCEC)\n- Kathmandu University Architecture Club (KUARC), Previously known as KUARSA\n- Natural and Social Concern Society (NSCS)\n- Society for Electrical and Electronic Engineers (SEEE)\n- |Society of Business Information Students (SBIS)\nNotable events\n[edit]TEDx\n[edit]Kathmandu University became the first university to host the university-level TEDx event in Nepal. The first iteration of this event/conference was conducted on December 23, 2019, under the tagline ‘Connecting Dots,’ in the central campus premises at Dhulikhel, Kavrepalanchok. TEDxKathmanduUniversity is an independently organized, completely non-profit TED event, which is operated under license from TED. TEDxKathmanduUniversity 2019 encompassed a handful of ideas to be delivered to the curious souls. The event aimed to impart the ideas circling around the following purviews: research ideas and methodologies; perks of being multidisciplinary; the importance of technology, computation and networking; and individual agency.\nSilver Jubilee\n[edit]Kathmandu University held a Ceremony at the main campus to mark the beginning of its year-long Silver Jubilee celebration. A Silver Jubilee Celebration Organizing Committee has been formed under the chairmanship of the chancellor, Rt. Hon'ble Prime Minister KP Sharma Oli.[16]\nSome of the programs envisioned include establishing Silver Jubilee Logo, inaugurating newly constructed buildings and constructing new ones, establishing Silver Jubilee Tower, felicitating well-known national and international scholars, organizing presentation programs with scholars from different fields, organizing KU Oration, exhibiting academic works of KU Family, publishing Silver Jubilee Souvenir and books, and organizing various sports and cultural programs.\nRt. Hon'ble President Bidya Devi Bhandari, who graced the ceremony as the chief guest, marked the inauguration of Silver Jubilee by unveiling the Silver Jubilee Logo and inaugurated the newly constructed buildings. Rt. Hon'ble Prime Minister KP Sharma Oli, the chancellor of the university, chaired the ceremony and laid the foundation stone of the Silver Jubilee Tower.\nThe inaugural ceremony included enlightening speeches of Hon'ble Minister for Education Giriraj Mani Pokhrel, Prof. Suresh Raj Sharma, the founding vice chancellor of KU, Mr. Daman Nath Dhungana, chairman of the board of trustees, and Prof. Dr. Ram Kantha Makaju Shrestha, vice chancellor.\nSeveral cultural presentations were held on the occasion along with plantation of plants of variety of species. Renowned personalities, heads of district offices along with local residents and KU Family showed their gracious presence and participation in the ceremony.\nSee also\n[edit]References\n[edit]- ^ \"Achyut Wagle appointed as vice chancellor of Kathmandu University\". The Kathmandu Post. Retrieved 7 July 2025.\n- ^ \"Kathmandu University\". Edu Sanjal.\n- ^ \"SCIENCE, RESEARCH, AND TECHNOLOGY IN NEPAL\" (PDF). Bajracharya, Dayanand; Bhuju, Dinesh Raj; Pokhrel, Jiba Raj. UNESCO Kathmandu Office. Retrieved 3 November 2007.\n- ^ \"KU Act 2048/1991\". Ministry of Education, Nepal. Retrieved 13 March 2016.\n- ^ Kathmandu University School of Management. \"About Us\". Kathmandu University School of Management Website. Retrieved 17 October 2023.\n- ^ Kathmandu University School of law. \"About Us\". Kathmandu University School of law Website. Retrieved 10 January 2022.\n- ^ \"Important Milestones of Kathmandu University\". ku.edu.np. Retrieved 13 March 2016.\n- ^ \"History of Kathmandu University and Important Milestone\". Edu Sanjal.\n- ^ \"Center for Buddhist Studies at Rangjung Yeshe Institute - ABOUT CBS\". Archived from the original on 14 August 2012. Retrieved 2 November 2012.\n- ^ \"DharmaSun\".\n- ^ \"Center for Buddhist Studies at Rangjung Yeshe Institute - Research\". Archived from the original on 14 August 2012. Retrieved 2 November 2012.\n- ^ \"Center for Buddhist Studies at Rangjung Yeshe Institute - Summer Courses\". Archived from the original on 14 August 2012. Retrieved 2 November 2012.\n- ^ \"Program Information, Yale Center for International Experience\". Archived from the original on 12 May 2013. Retrieved 2 November 2012.\n- ^ \"UC Berkeley, Buddhist Studies, Study Abroad Opportunities\". Archived from the original on 4 December 2012. Retrieved 2 November 2012.\n- ^ \"Boston College, International Programs\". Archived from the original on 13 October 2012. Retrieved 2 November 2012.\n- ^ \"Kathmandu University News | Silver Jubilee Inaugural Ceremony Held\". ku.edu.np. Retrieved 13 March 2016.\nSources\n[edit]- \"Kathmandu University Act, 2048 (1991)\". Ministry of Education, Government of Nepal. Retrieved 13 March 2016.\nExternal links\n[edit]- Kathmandu University Scholarships for Undergraduate Students\n- Centre for Buddhist Studies, Kathmandu University\n- Rangjung Yeshe Institute\n- Kathmandu University's Recent Notices and Results\n- Turbine Testing Lab, Kathmandu University\n- Kathmandu University Biotechnology Creatives (KUBiC)\n- Green Club of Thoughts\nThis article's use of external links may not follow Wikipedia's policies or guidelines. (January 2024) |",
        "summarized": "Kathmandu University is an autonomous university in Nepal, established in 1991 with the motto \"Quality Education for Leadership.\" It operates through seven schools and offers undergraduate, graduate, and postgraduate courses in various fields.\n\nThe precursor to the university, Kathmandu Valley Campus, was established in 1985. The proposal to establish the university was discussed in the Parliament and approved through an Act on December 11, 1991.\n\nKathmandu University became the first privately managed public institution of higher learning in Nepal when it was established in November 1991. It started its academic program in 1992 with an Intermediate in Science program.\n\nThe university has launched various programs over the years, including Bachelor programs in Pharmacy, Biology, and Engineering, as well as M.Phil. and Ph.D. programs. The School of Management runs undergraduate and graduate-level courses like Bachelor of Business Administration and Master of Business Administration.\n\nKathmandu University provides education through seven schools: School of Arts, School of Education, School of Engineering, School of Law, School of Management, School of Medical Sciences, and School of Science.\n\nThe university has proposed two new schools in Panchkhal Municipality under which Agriculture program and Artificial Program have been started temporarily. The School of Medical Sciences and the School of Engineering have the highest number of students.\n\nKathmandu University hosts the university-level TEDx event in Nepal, which was conducted on December 23, 2019. The university held a Ceremony at the main campus to mark the beginning of its year-long Silver Jubilee celebration.\n\nThe inaugural ceremony included enlightening speeches of Hon'ble Minister for Education Giriraj Mani Pokhrel and Prof. Suresh Raj Sharma, the founding vice chancellor of KU. Several cultural presentations were held on the occasion along with plantation of plants of various species."
    },
    {
        "original": "Placement Cell facilitates undergraduate & postgraduate students to get placements in Organizations\nSoM Journals & Faculty Publications\nSchool of Management Admission for Undergraduate, Graduate, MPhil & PhD\nWelcome to School of Management, Kathmandu University, Balkumari, Lalitpur\nDEPARTMENTS\nCURRENT STUDENTS\nGRADUATED STUDENTS\nFull Time Faculty\nOne fine body…",
        "summarized": "Placement Cell facilitates undergraduate & postgraduate students to get placements in Organizations.\nSoM Journals & Faculty Publications.\nSchool of Management Admission for Undergraduate, Graduate, MPhil & PhD.\nWelcome to School of Management, Kathmandu University, Balkumari, Lalitpur.\nDEPARTMENTS.\nCURRENT STUDENTS.\nGRADUATED STUDENTS.\nFull Time Faculty."
    },
    {
        "original": "Search programs...\nView all programs\nAn op-ed on “काठमाडौँ विश्वविद्यालयमा मिडिया अध्ययनका डेढ दशक” (translation: One and a half decades of Media Studies at Kathmandu University) by Dr. Nirmala Mani Adhikary, Associate Professor at the School of Arts was published on the Gorkhapatra Online on January 1, 2022.\nThe article focuses on the Bachelor of Media Studies program, a four-year undergraduate program of the Department ...",
        "summarized": "Search programs...\nView all programs\nAn op-ed on “काठमाडौँ विश्वविद्यालयमा मिडिया अध्ययनका डेढ दशक” (translation: One and a half decades of Media Studies at Kathmandu University) by Dr. Nirmala Mani Adhikary, Associate Professor at the School of Arts was published on the Gorkhapatra Online on January 1, 2022.\nThe article focuses on the Bachelor of Media Studies program, a four-year undergraduate program of the Department ..."
    },
    {
        "original": "kathmandu university school of medical sciences\nKathmandu University School of Medical Sciences (KUSMS) is an institution established in collaboration between Kathmandu University and Dhulikhel Hospital. KUSMS launched its own constituent MBBS program in August 2001.\nThe school has infrastructure and physical facilities at two locations: basic science building with all the required facilities is situated at a hilltop at Chaukot in the Panauti area and the university hospital is situated at Dhulikhel, within a distance of 3 km.\nBasic science department has various departments with the required number of laboratories, lecture halls including PBL class rooms, audio visual facilities (media tech.) and library .\nDEAN'S MESSAGE\nProf. Dr. Manoj Humagain\nDean\nWith the main mission of “Quality Education for Leadership”, Kathmandu University was established in 1990, which is not for profit and self-sustainable first public university of the country. Kathmandu University School of Medical Sciences (KUSMS) is one of the leading and pioneer institutes in the field of medical and allied health sciences in the country since 1994. Within almost 30 years of its establishment it has spread its academic programs to almost all the provinces of the country through it’s constituent and affiliated colleges.\nAt Kathmandu University School of Medical Sciences (KUSMS), we thrive for the academic excellence and we act to make it achievable. The creativity, hard work of each and every individuals working in this school and visionary leaders makes this university unique in itself.\nDEAN'S MESSAGE\nProf. Dr. Manoj Humagain\nDean\nWith the main mission of “Quality Education for Leadership”, Kathmandu University was established in 1990, which is not for profit and self-sustainable first public university of the country. Kathmandu University School of Medical Sciences (KUSMS) is one of the leading and pioneer institutes in the field of medical and allied health sciences in the country since 1994. Within almost 30 years of its establishment it has spread its academic programs to almost all the provinces of the country through it’s constituent and affiliated colleges.\nAt Kathmandu University School of Medical Sciences (KUSMS), we thrive for the academic excellence and we act to make it achievable. The creativity, hard work of each and every individuals working in this school and visionary leaders makes this university unique in itself.\nnew program Commenced\nat KUSMS\nBACHELOR OF SCIENCE IN LABORATORY MEDICINE\nBachelor of Science in Laboratory Medicine (B.Sc.Lab. Med.) is a long awaited four years degree program led by nationally and internationally renowned faculties, laboratory professional, doctors, researcher and biomedical engineers under KUSMS.\nBACHELOR OF SCIENCE IN MEDICAL IMAGING TECHNOLOGY\nBachelor of Science in Medical Imaging Technology (B.Sc. MIT) Program is another specialty which plays crucial role in the diagnosis of many disease by using radiological techniques such as CT scan, MRI, USG, X-ray PET CT etc.\nDhulikhel hospital\nDhulikhel Hospital is an independent, not for profit, non-government institution which was conceived and supported by the Dhulikhel community, as a quality health services provider. Dhulikhel hospital is also the university hospital for all the medical programs run under the collaboration with Kathmandu University (constituent medical programs of Kathmandu University).\nKathmandu University\nKathmandu University is an autonomous, not-for-profit, non - government institution dedicated to maintain high standards of academic excellence. The mission statement of the University is “to provide quality education for leadership”. The vision is “to become a world-class university devoted to bringing knowledge and technology to the service of mankind”.\nMileStones\n1994\n2001\n2004\n2008\n2011\n2019\n1998\n2003\n2007\n2010\n2016\n2022\nold website\nCouldn’t find what you are looking for ? Old website can help you out.",
        "summarized": "Kathmandu University School of Medical Sciences (KUSMS) is an institution established in collaboration between Kathmandu University and Dhulikhel Hospital. KUSMS launched its own constituent MBBS program in August 2001.\nThe school has infrastructure and physical facilities at two locations: basic science building with all the required facilities is situated at a hilltop at Chaukot in the Panauti area and the university hospital is situated at Dhulikhel, within a distance of 3 km.\nWith the main mission of “Quality Education for Leadership”, Kathmandu University was established in 1990, which is not for profit and self-sustainable first public university of the country. \nKathmandu University School of Medical Sciences (KUSMS) is one of the leading and pioneer institutes in the field of medical and allied health sciences in the country since 1994.\nAt Kathmandu University School of Medical Sciences (KUSMS), we thrive for the academic excellence and we act to make it achievable. \nBachelor of Science in Laboratory Medicine (B.Sc.Lab. Med.) is a long awaited four years degree program led by nationally and internationally renowned faculties, laboratory professional, doctors, researcher and biomedical engineers under KUSMS.\nDhulikhel Hospital is an independent, not for profit, non-government institution which was conceived and supported by the Dhulikhel community, as a quality health services provider. \nKathmandu University is an autonomous, not-for-profit, non - government institution dedicated to maintain high standards of academic excellence."
    },
    {
        "original": "We are much honored to welcome you all to the School of Engineering (SoE) at Kathmandu University, Nepal. As the country’s first autonomous, not-for-profit, self-funding public institution in Higher Education in Engineering programs, School of Engineering (SoE) paved the way and is now a world class engineering school that proudly represents our country Nepal in the global arena.\nWant to make your Career in Engineering? Apply for our Undergraduate Programs.\nDepartments\nPrograms\nStudents\nFaculty Staff",
        "summarized": "We are much honored to welcome you all to the School of Engineering (SoE) at Kathmandu University, Nepal. As the country’s first autonomous, not-for-profit, self-funding public institution in Higher Education in Engineering programs, School of Engineering (SoE) paved the way and is now a world class engineering school that proudly represents our country Nepal in the global arena.\nWant to make your Career in Engineering? Apply for our Undergraduate Programs."
    },
    {
        "original": "The School of Law is the seventh and latest School at Kathmandu University. It was established in 2014 to tap the great opportunity abundant in Nepal for a high quality law school, which can maintain an educational programme that prepares its students for admission to the bar, and effective as well as responsible participation in the legal profession.\nPrograms\nCurrent Students\nGraduated Students\nFull Time Faculties",
        "summarized": "The School of Law is the seventh and latest School at Kathmandu University. It was established in 2014 to tap the great opportunity abundant in Nepal for a high quality law school, which can maintain an educational programme that prepares its students for admission to the bar, and effective as well as responsible participation in the legal profession."
    },
    {
        "original": "Factors Affecting Turnaround Time in the Clinical Laboratory of the Kathmandu University Hospital, Nepal\n- PMID: 30881271\n- PMCID: PMC6416806\nFactors Affecting Turnaround Time in the Clinical Laboratory of the Kathmandu University Hospital, Nepal\nAbstract\nBackground: The turnaround time (TAT) as defined by most of the laboratories is the time interval between the specimens received in the laboratory to the time of reports dispatched with verification. Nearly 80% of hospital-attached clinical laboratories receive complaints about delayed TAT. Reporting in time is a crucial indicator of quality services along with accurate, precise and reliable reports, thus each clinical laboratory should identify affecting factors to eliminate them for the enhancement of quality services.\nMethodology: Dhulikhel Hospital-Kathmandu University Hospital is a tertiary care hospital, where this observational descriptive study was conducted in 2017. Requested tests received on database in the Department of Clinical Biochemistry Laboratory along with test requisition form (TRF) were carefully screened for any possible error. When analysis of individual patient's tests was completed, results of individual parameters were entered in the database manually. TAT was calculated as a time period between specimens received to analysis completed. Once test analysis has completed it was immediately followed by verification.\nResults: A total of 36,108 patients' reports generated from the Department of Clinical Biochemistry Laboratory during study period were analyzed. Nearly 36% of reports exceeded the predefined TAT in case of stat tests, while around 7% of reports were out of predefined TAT in case of routine tests. Among prolonged TAT, around 75% of reports were delayed due to various extra analytical reasons and approximately 48% of total delayed reports were found only due to error by cash unit.\nConclusion: The major reasons of delayed laboratory reports were due to time consumed to fix the pre-analytical errors created by other departments rather than laboratory itself. Cash unit alone has the highest degree of error in total testing process and it is the most significant factor for prolonged TAT. However reasons for prolonged TAT may vary with hospital to hospital depending upon different factors.\nKeywords: quality service; total testing process (TTP); turnaround time (TAT).\nFigures\nSimilar articles\n-\nTurnaround Time: An Efficacy Measure for Medical Laboratories.Cureus. 2022 Sep 6;14(9):e28824. doi: 10.7759/cureus.28824. eCollection 2022 Sep. Cureus. 2022. PMID: 36225468 Free PMC article. Review.\n-\nPhysician satisfaction and emergency department laboratory test turnaround time.Arch Pathol Lab Med. 2001 Jul;125(7):863-71. doi: 10.5858/2001-125-0863-PSAEDL. Arch Pathol Lab Med. 2001. PMID: 11419969\n-\nMonitoring and Root Cause Analysis of Clinical Biochemistry Turnaround Time at a Tertiary Care Institute.Cureus. 2023 Jun 1;15(6):e39821. doi: 10.7759/cureus.39821. eCollection 2023 Jun. Cureus. 2023. PMID: 37397669 Free PMC article.\n-\nTurnaround Time (TAT): Difference in Concept for Laboratory and Clinician.Indian J Hematol Blood Transfus. 2014 Jun;30(2):81-4. doi: 10.1007/s12288-012-0214-3. Epub 2012 Nov 8. Indian J Hematol Blood Transfus. 2014. PMID: 24839360 Free PMC article. Review.\n-\nLean Six Sigma Methodologies to Reduce the Cardiac Troponin Turnaround Time in the Core Laboratory.Lab Med. 2023 Mar 7;54(2):e49-e53. doi: 10.1093/labmed/lmac088. Lab Med. 2023. PMID: 35998092\nCited by\n-\nStatus of countrywide laboratory services quality and capacity in primary healthcare facilities in Tanzania: Findings from Star Rating Assessment.PLOS Glob Public Health. 2023 Oct 18;3(10):e0001489. doi: 10.1371/journal.pgph.0001489. eCollection 2023. PLOS Glob Public Health. 2023. PMID: 37851603 Free PMC article.\n-\nTurnaround Time: An Efficacy Measure for Medical Laboratories.Cureus. 2022 Sep 6;14(9):e28824. doi: 10.7759/cureus.28824. eCollection 2022 Sep. Cureus. 2022. PMID: 36225468 Free PMC article. Review.\n-\nEvaluating turnaround time to improve clients' satisfaction in the tuberculosis reference laboratory in Douala.PLoS One. 2025 Jun 13;20(6):e0323917. doi: 10.1371/journal.pone.0323917. eCollection 2025. PLoS One. 2025. PMID: 40512739 Free PMC article.\n-\nQuality Assurance for Hepatitis C Virus Point-of-Care Diagnostics in Sub-Saharan Africa.Diagnostics (Basel). 2023 Feb 12;13(4):684. doi: 10.3390/diagnostics13040684. Diagnostics (Basel). 2023. PMID: 36832172 Free PMC article. Review.\n-\nRapid Visual Detection of Methicillin-Resistant Staphylococcus aureus in Human Clinical Samples via Closed LAMP Assay Targeting mecA and spa Genes.Microorganisms. 2024 Jan 12;12(1):157. doi: 10.3390/microorganisms12010157. Microorganisms. 2024. PMID: 38257983 Free PMC article.\nReferences\n-\n- Plebani M. Errors in clinical laboratories or errors in laboratory medicine? Clin Chem Lab Med. 2006;44(6):750-759. - PubMed\n-\n- Antal-Szalmas P, Ivady G, Molnar A, Hevessy Z, Kissne Sziraki V, V Olah A, et al. [“Turnaround time”: a new parameter for the characterization of the overall efficacy of laboratory diagnostic processes]. Orv Hetil. 2007;148(28):1317-1327. - PubMed\n-\n- Carraro P, Plebani M. Process control reduces the laboratory turnaround time. Clin Chem Lab Med. 2002;40(4):421-422. - PubMed\n-\n- Froom P, Barak M. Auto-validation of complete blood counts in an outpatient’s regional laboratory. Clin Chem Lab Med. 2015;53(2):275-279. - PubMed\n-\n- Manor PG. Turnaround times in the laboratory: a review of the literature. Clin Lab Sci. 1999;12(2):85-89. - PubMed\nLinkOut - more resources\nFull Text Sources",
        "summarized": "Nearly 80% of hospital-attached clinical laboratories receive complaints about delayed turnaround time (TAT).\nReporting in time is a crucial indicator of quality services along with accurate, precise and reliable reports.\nThe major reasons of delayed laboratory reports were due to time consumed to fix the pre-analytical errors created by other departments rather than laboratory itself.\nCash unit alone has the highest degree of error in total testing process and it is the most significant factor for prolonged TAT."
    },
    {
        "original": "Dhulikhel Hospital Kathmandu University Hospital/Kathmandu University School of Medical Sciences\nFellowship Site Directors: Dr. Biraj Man Karmacharya\nSite Contact: Dr. Biraj Man Karmacharya birajmk@kusms.edu.np Mobile: +9779808660568\nLink to research site’s website: https://research.dhulikhelhospital.org/\nSite Specialties:\nInfectious Diseases\nNon-communicable Diseases\nImplementation Science\nHealth Systems\nmHealth Technologies\nPopulation Health Studies\nClinical Trials\nDHKUH/KUSMS is the largest provider of tertiary level health care in Nepal and also spearheads the country’s health sciences research. Its vision is to become a world class research-intensive school over the next decade.\nThe School of Medical Sciences is the largest school of Kathmandu University (KU) and is the leader in the field of health sciences education and research in Nepal. Every year it produces more than 1,000 medical doctors, 250 specialized doctors and other 1,000 health professionals in different fields. Through Dhulikhel Hospital- its central University Hospital, and the hospitals of other seven affiliated medical colleges, KU is also the largest provider of tertiary level health care in Nepal and also spearheads the field of health sciences research in the country.\nKUSMS offers academic programs in medicine, dentistry, public health, nursing, human biology, pharmacy, lab medicine, radio-imaging technology and physiotherapy. Every year, it produces approximately 2150 health professionals in different fields through the central college and its seven affiliate medical colleges. Dhulikhel Hospital is a community service-oriented hospital guided by the principles of social equity, sustainable development, harmony with nature, and supported by the Dhulikhel community. The hospital was founded with the belief that Quality Health Care should be accessible to people from easy to reach hard to reach communities.\nDHKUH is a community service-oriented hospital guided by the principles of social equity, sustainable development, harmony with nature, and supported by the Dhulikhel community. DHKUH is a standalone tertiary care center which provides healthcare services to people from more than 50 districts with the catchment population of approximately 3 million people from Kavrepalanchowk, Sindhupalchowk, Dolakha, Sindhuli, Ramechhap, Bhaktapur, and other surrounding districts. Although there are primary health care centers and health posts under the government health care system there is a huge mass of population and areas that go amiss in seeking care especially for IDs and EIDs. There is an utmost need for an advanced center that caters to the health care needs of these people.\nInstitutional Core Strength Areas:\nSurveys and Longitudinal Studies\nDH oversees large surveys ranging from population-based health surveys to quality of care surveys in health facilities. The Dhulikhel Heart Study, started in 2013 is a longitudinal cohort study on non-communicable diseases and their risk factors. There are also ongoing population-based serosurveillance going on in partnership with Stanford University, University of Toronto and other organizations. Several other studies encompass longitudinal studies on women’s health as well including cervical cancer. There is an ongoing work to develop a large cohort on school children in coordination with the School Nurse Program of Bagmati Province. DH also has dedicated teams that are working on the secondary data analysis of major national surveys. As a part of the Healthy City Initiative, DH recently collaborated with the Dhulikhel municipality in conducting household-level health surveys of the municipality and is developing it as a long-term cohort study.\nHealth Systems and Policies related Studies\nThere are also multiple health systems related ongoing studies. DH recently completed a Primary Health Care assessment and costing exercise at the local levels of Nepal in partnership with UNICEF. There is also an ongoing study on the assessment of national health insurance program, and determination of facilitators and barriers to insurance enrollment and retention. A nationwide study on patients’ response/satisfaction on the quality of care at hospital level is also under preparation in partnership with the Curative Service Division. Piloting of the study has been completed at Dhulikhel Hospital. A novel study on Unannounced Standardized Patient (USP) for quality-of-care assessment is also underway in partnership with international teams from China, Switzerland and UK. DH also recently completed several studies related to the impact of COVID-19 on health system. Through the funding of SAARC Tuberculosis and HIV Center, we conducted a national assessment of COVID-19 on the Directly Observed Treatment of tuberculosis. DH collaborates with WHO and the Epidemiology and Disease Control Division in conducting studies related to NCD care. A recent effort in partnership with Harvard University, University of Bergen and Kathmandu Institute of Child Health also focuses on Time-Driven-Activity-Based Costing approach to health financing evaluation and impacts.\nImplementation Research, Rapid Assessments, and Monitoring and Evaluation\nAnother major strength of DH lies in the implementation research and community-based rapid assessments. The Behavior Science Center established in partnership with John Snow Inc. and UNICEF led a pioneering work on the rapid assessment of targeted communities on vaccine hesitancy on several parts of the country. The findings were then developed to develop interventions, which were implemented and evaluated as an implementation research project. The team also led the efforts in addressing recent measles outbreak in Western Nepal. There are several other implementation studies going on in the field of non-communicable diseases in partnership with Ministry of Health and Population, Nepal Health Research Council, Provincial and local governments.\nInfectious Diseases\nA dedicated Center for Infectious Diseases is also leading several clinical, epidemiological, and laboratory-based studies (including genomic studies) on infectious diseases research. This is being done in collaboration with Stanford University, University of Toronto, Harvard University, International Vaccine Institute, National Institutes of Health, Bill and Melinda Gates Foundation, Chan Zuckerberg Biohub, etc. Several clinical trials have been successfully completed and there are several underway. Most notable of this has been the typhoid vaccine trial, COVID-19 vaccine trial and lately the Oral Cholera vaccine trial. A state-of-the-art infectious disease research lab with capacity of advanced molecular works is an asset to these works. Recently the center has also initiated infectious diseases related to climate change and is collaborating with several other institutions to build this area. Norwegian Institute of Public Health is a major partner in this effort.\nNew Areas and Partnerships\nThere are also several teams working in establishing dedicated centers for research on gender and migration, domestic violence, adolescent health, and antibiotic stewardship. Recent partnerships with External Development Partners like the WHO, GIZ, UNDP, UNICEF also open newer avenues of collaborative works to bridge government, academia and the development partners.\nCapacity Building\nAs the academic hub of Kathmandu University School of Medical Sciences, DH leads several efforts on capacity building and knowledge management in the field of health research. A dedicated Training Center within the institution serves as one of the largest training facilities of Nepal conducting almost 90 short and long-term trainings annually. The pioneering MScPH (Epidemiology and Global Health) program, and the PhD Program in Health Sciences (including Public Health) drives a constellation of activities focused on health research training. DH/KUSMS also initiated the formation of Consortium of Academic Institutions for Public Health in Nepal (CAIPHEN) and currently houses and leads it. Through this, there is a nationwide effort underway to reform public health training and research. Regular programs on in-house trainings and support for staffs and faculty help improvise and constantly reinvigorate the research and academic programs of the institution.",
        "summarized": "Dhulikhel Hospital Kathmandu University Hospital/Kathmandu University School of Medical Sciences \nFellowship Site Directors: Dr. Biraj Man Karmacharya\nSite Contact: Dr. Biraj Man Karmacharya birajmk@kusms.edu.np Mobile: +9779808660568\nLink to research site’s website: https://research.dhulikhelhospital.org/\nSite Specialties:\nInfectious Diseases\nNon-communicable Diseases\nImplementation Science\nHealth Systems\nmHealth Technologies\nPopulation Health Studies\nClinical Trials\nDHKUH/KUSMS is the largest provider of tertiary level health care in Nepal and also spearheads the country’s health sciences research. Its vision is to become a world class research-intensive school over the next decade.\nThe School of Medical Sciences is the largest school of Kathmandu University (KU) and is the leader in the field of health sciences education and research in Nepal. Every year it produces more than 1,000 medical doctors, 250 specialized doctors and other 1,000 health professionals in different fields. Through Dhulikhel Hospital- its central University Hospital, and the hospitals of other seven affiliated medical colleges, KU is also the largest provider of tertiary level health care in Nepal and also spearheads the field of health sciences research in the country.\nKUSMS offers academic programs in medicine, dentistry, public health, nursing, human biology, pharmacy, lab medicine, radio-imaging technology and physiotherapy. Every year, it produces approximately 2150 health professionals in different fields through the central college and its seven affiliate medical colleges. Dhulikhel Hospital is a community service-oriented hospital guided by the principles of social equity, sustainable development, harmony with nature, and supported by the Dhulikhel community. The hospital was founded with the belief that Quality Health Care should be accessible to people from easy to reach hard to reach communities.\nDHKUH is a community service-oriented hospital guided by the principles of social equity, sustainable development, harmony with nature, and supported by the Dhulikhel community. DHKUH is a standalone tertiary care center which provides healthcare services to people from more than 50 districts with the catchment population of approximately 3 million people from Kavrepalanchowk, Sindhupalchowk, Dolakha, Sindhuli, Ramechhap, Bhaktapur, and other surrounding districts. Although there are primary health care centers and health posts under the government health care system there is a huge mass of population and areas that go amiss in seeking care especially for IDs and EIDs. There is an utmost need for an advanced center that caters to the health care needs of these people.\nInstitutional Core Strength Areas:\nSurveys and Longitudinal Studies\nDH oversees large surveys ranging from population-based health surveys to quality of care surveys in health facilities. The Dhulikhel Heart Study, started in 2013 is a longitudinal cohort study on non-communicable diseases and their risk factors. There are also ongoing population-based serosurveillance going on in partnership with Stanford University, University of Toronto and other organizations. Several other studies encompass longitudinal studies on women’s health as well including cervical cancer. There is an ongoing work to develop a large cohort on school children in coordination with the School Nurse Program of Bagmati Province. DH also has dedicated teams that are working on the secondary data analysis of major national surveys. As a part of the Healthy City Initiative, DH recently collaborated with the Dhulikhel municipality in conducting household-level health surveys of the municipality and is developing it as a long-term cohort study.\nHealth Systems and Policies related Studies\nThere are also multiple health systems related ongoing studies. DH recently completed a Primary Health Care assessment and costing exercise at the local levels of Nepal in partnership with UNICEF. There is also an ongoing study on the assessment of national health insurance program, and determination of facilitators and barriers to insurance enrollment and retention. A nationwide study on patients’ response/satisfaction on the quality of care at hospital level is also under preparation in partnership with the Curative Service Division. Piloting of the study has been completed at Dhulikhel Hospital. A novel study on Unannounced Standardized Patient (USP) for quality-of-care assessment is also underway in partnership with international teams from China, Switzerland and UK. DH also recently completed several studies related to the impact of COVID-19 on health system. Through the funding of SAARC Tuberculosis and HIV Center, we conducted a national assessment of COVID-19 on the Directly Observed Treatment of tuberculosis. DH collaborates with WHO and the Epidemiology and Disease Control Division in conducting studies related to NCD care. A recent effort in partnership with Harvard University, University of Bergen and Kathmandu Institute of Child Health also focuses on Time-Driven-Activity-Based Costing approach to health financing evaluation and impacts.\nImplementation Research, Rapid Assessments, and Monitoring and Evaluation\nAnother major strength of DH lies in the implementation research and community-based rapid assessments. The Behavior Science Center established in partnership with John Snow Inc. and UNICEF led a pioneering work on the rapid assessment of targeted communities on vaccine hesitancy on several parts of the country. The findings were then developed to develop interventions, which were implemented and evaluated as an implementation research project. The team also led the efforts in addressing recent measles outbreak in Western Nepal. There are several other implementation studies going on in the field of non-communicable diseases in partnership with Ministry of Health and Population, Nepal Health Research Council, Provincial and local governments.\nInfectious Diseases\nA dedicated Center for Infectious Diseases is also leading several clinical, epidemiological, and laboratory-based studies (including genomic studies) on infectious diseases research. This is being done in collaboration with Stanford University, University of Toronto, Harvard University, International Vaccine Institute, National Institutes of Health, Bill and Melinda Gates Foundation, Chan Zuckerberg Biohub, etc. Several clinical trials have been successfully completed and there are several underway. Most notable of this has been the typhoid vaccine trial, COVID-19 vaccine trial and lately the Oral Cholera vaccine trial. A state-of-the-art infectious disease research lab with capacity of advanced molecular works is an asset to these works. Recently the center has also initiated infectious diseases related to climate change and is collaborating with several other institutions to build this area. Norwegian Institute of Public Health is a major partner in this effort.\nNew Areas and Partnerships\nThere are also several teams working in establishing dedicated centers for research on gender and migration, domestic violence, adolescent health, and antibiotic stewardship. Recent partnerships with External Development Partners like the WHO, GIZ, UNDP, UNICEF also open newer avenues of collaborative works to bridge government, academia and the development partners.\nCapacity Building\nAs the academic hub of Kathmandu University School of Medical Sciences, DH leads several efforts on capacity building and knowledge management in the field of health research. A dedicated Training Center within the institution serves as one of the largest training facilities of Nepal conducting almost 90 short and long-term trainings annually. The pioneering MScPH (Epidemiology and Global Health) program, and the PhD Program in Health Sciences (including Public Health) drives a constellation of activities focused on health research training. DH/KUSMS also initiated the formation of Consortium of Academic Institutions for Public Health in Nepal (CAIPHEN) and currently houses and leads it. Through this, there is a nationwide effort underway to reform public health training and research. Regular programs on in-house trainings and support for staffs and faculty help improvise and constantly reinvigorate the research and academic programs of the institution."
    },
    {
        "original": "Kathmandu University High School\nCultivating socially responsible & sensible citizensHeritage and History\nKathmandu University High School, initially named as Kathmandu University Preparatory School was established in 1998 A.D. with only 60 primary students from local areas and children of the staffs of Kathmandu University. The School started in a rented building near by a beautiful place called Bansghari in Dhulikhel with few staff by Mr. Aiden Warlow as a principal. The school always has been a non-profit making organization established under the umbrella of Kathmandu University.\nRead more-\nPrimary School\nThe Primary School consists of five grades (I – V) with one single class in each grade.\n+ -\nSecondary School\nThe Secondary School consists of five grades (VI – X) with one single class in each grade.\n+ -\nHigher Secondary School\nKUHS +2 (Science) General Information\n+ -\nClass 11 2082 Admission Procedure\nClass 11 2082, Admission Procedure\n+\n-\n15 Jul 2025Early Departure Notice during Frist Terminal Examination\n15 July 2025 Dear Parents, As we approach the upcoming examination period, we would like to inform you that students will have early departure from school from coming Thursday (Shrawan […]\nRead More -\n15 Jul 2025FIRST TERM EXAMS RULES AND REGULATIONS\nFIRST TERM EXAMS RULES AND REGULATIONS 15 July 2025 All school rules must be observed throughout the entire exam. Students go home as per the Schedule mentioned in the Newsletter. […]\nRead More\nVACANCY ANNOUNCEMENT\nKathmandu University High School is seeking an application from qualified and experienced individuals for the following position for the academic session 2082",
        "summarized": "Kathmandu University High School, initially named as Kathmandu University Preparatory School was established in 1998 A.D. with only 60 primary students from local areas and children of the staffs of Kathmandu University.\nThe Primary School consists of five grades (I – V) with one single class in each grade.\nThe Secondary School consists of five grades (VI – X) with one single class in each grade.\nKUHS +2 (Science) General Information\nClass 11 2082 Admission Procedure\n15 Jul 2025Dear Parents, As we approach the upcoming examination period, we would like to inform you that students will have early departure from school from coming Thursday (Shrawan […]\nAll school rules must be observed throughout the entire exam. Students go home as per the Schedule mentioned in the Newsletter.\nKathmandu University High School is seeking an application from qualified and experienced individuals for the following position for the academic session 2082"
    }
]